## Proxmox Terraform Plan
  ```terraform
  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # proxmox_vm_qemu.vm["haproxy-testing.yaml"] must be replaced
-/+ resource "proxmox_vm_qemu" "vm" {
      + bootdisk               = (known after apply)
      + clone                  = "ubuntu-24.04-template" # forces replacement
      ~ current_node           = "node01" -> (known after apply)
      ~ default_ipv4_address   = "192.168.1.24" -> (known after apply)
      + default_ipv6_address   = (known after apply)
      ~ full_clone             = false -> true # forces replacement
      ~ id                     = "node01/qemu/102" -> (known after apply)
      ~ linked_vmid            = 0 -> (known after apply)
        name                   = "haproxy-testing"
      - numa                   = false -> null
      - qemu_os                = "other" -> null
      ~ reboot_required        = false -> (known after apply)
      ~ ssh_host               = "192.168.1.24" -> (known after apply)
      ~ ssh_port               = "22" -> (known after apply)
      ~ sshkeys                = <<-EOT
            ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIP+mJj63c+7o+Bu40wNnXwTpXkPTpGJA9OIprmNoljKI pedro@pedro-Legion-5-16IRX9
        EOT
        tags                   = "terraform"
      ~ unused_disk            = [] -> (known after apply)
      ~ vmid                   = 102 -> (known after apply)
        # (37 unchanged attributes hidden)

      ~ disks {
          ~ ide {
              ~ ide1 {
                  - ignore = false -> null

                    # (1 unchanged block hidden)
                }
            }
          ~ scsi {
              ~ scsi0 {
                  - ignore = false -> null

                  ~ disk {
                      - discard              = false -> null
                      - emulatessd           = false -> null
                      ~ id                   = 0 -> (known after apply)
                      - iothread             = false -> null
                      ~ linked_disk_id       = -1 -> (known after apply)
                      - readonly             = false -> null
                      - replicate            = false -> null
                        # (18 unchanged attributes hidden)
                    }
                }
            }
        }

      ~ network {
            id        = 0
          ~ macaddr   = "bc:24:11:07:80:d8" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }

      ~ smbios (known after apply)
      - smbios {
          - uuid         = "cde3fc88-6d1c-458f-8fa5-36b647871b6e" -> null
            # (6 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

  ```
  
  Plan exit code: 0
  